In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                'key2' : ['one', 'two', 'one', 'two', 'one'],
                'data1' : np.random.randn(5),
                'data2' : np.random.randn(5)})

In [4]:
df

  key1 key2     data1     data2
0    a  one  0.479051  1.511494
1    a  two  0.263512  0.698786
2    b  one  0.320063 -0.617645
3    b  two  0.327264  0.581667
4    a  one  0.009793  2.124287

In [7]:
group = df['data1'].groupby(df['key1'])

In [8]:
group.mean()

key1
a    0.250785
b    0.323664
Name: data1, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [10]:
means

key1  key2
a     one     0.244422
      two     0.263512
b     one     0.320063
      two     0.327264
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a     0.244422  0.263512
b     0.320063  0.327264

In [14]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states,years]).mean()

California  2005    0.263512
            2006    0.320063
Ohio        2005    0.403157
            2006    0.009793
Name: data1, dtype: float64

In [15]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.250785  1.444856
b     0.323664 -0.017989

In [18]:
size = df.groupby(['key1','key2'])

In [19]:
size.size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [26]:
for name, group in df.groupby(by='key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.479051  1.511494
1    a  two  0.263512  0.698786
4    a  one  0.009793  2.124287
b
  key1 key2     data1     data2
2    b  one  0.320063 -0.617645
3    b  two  0.327264  0.581667

In [27]:
for (k1,k2), group in df.groupby(by=['key1','key2']):
    print(k1,k2)
    print(group)

a one
  key1 key2     data1     data2
0    a  one  0.479051  1.511494
4    a  one  0.009793  2.124287
a two
  key1 key2     data1     data2
1    a  two  0.263512  0.698786
b one
  key1 key2     data1     data2
2    b  one  0.320063 -0.617645
b two
  key1 key2     data1     data2
3    b  two  0.327264  0.581667

In [28]:
pieces = dict(list(df.groupby('key1')))

In [31]:
pieces['a']

  key1 key2     data1     data2
0    a  one  0.479051  1.511494
1    a  two  0.263512  0.698786
4    a  one  0.009793  2.124287

In [32]:
types = df.groupby(by=df.dtypes,axis=1)

In [34]:
types.size()

float64    2
object     2
dtype: int64

In [41]:
df[['data1','data2']].div(df[['data1','data2']].sum(axis=0),axis=1)

      data1     data2
0  0.342257  0.351626
1  0.188266  0.162562
2  0.228669 -0.143686
3  0.233813  0.135316
4  0.006996  0.494182

In [44]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                'key2' : ['one', 'two', 'one', 'two', 'one'],
                'data1' : np.random.randn(5),
                'data2' : np.random.randn(5)})

In [45]:
df.groupby(['key1', 'key2'])[['data1','data2']].mean()

              data1     data2
key1 key2
a    one   0.077305  1.504085
     two  -0.026491 -0.339985
b    one   1.020548 -2.039771
     two   2.354768  2.193726

In [48]:
s_grouped = df.groupby(['key1', 'key2'])['data1']

In [49]:
s_grouped

In [50]:
s_grouped.mean()

key1  key2
a     one     0.077305
      two    -0.026491
b     one     1.020548
      two     2.354768
Name: data1, dtype: float64

In [64]:
people = pd.DataFrame(np.random.randn(5, 5),
     columns=['a', 'b', 'c', 'd', 'e'],
     index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [65]:
people

               a         b         c         d         e
Joe     0.006659  1.057309 -1.242449  0.751803 -0.829052
Steve   0.471576  0.428780  0.199030  1.042627  0.338245
Wes     0.012357 -1.507546 -1.956075  1.352760 -0.571196
Jim     0.412184  0.273238  0.624758  0.550701 -0.700011
Travis  0.394687  1.485726 -0.236599 -0.924655  0.032278

In [66]:
people.loc['Wes','b':'c'] = np.nan

In [67]:
people

               a         b         c         d         e
Joe     0.006659  1.057309 -1.242449  0.751803 -0.829052
Steve   0.471576  0.428780  0.199030  1.042627  0.338245
Wes     0.012357       NaN       NaN  1.352760 -0.571196
Jim     0.412184  0.273238  0.624758  0.550701 -0.700011
Travis  0.394687  1.485726 -0.236599 -0.924655  0.032278

In [68]:
#grouping wiht a dictionary
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
     'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [72]:
by_column = people.groupby(by=mapping,axis=1)

In [73]:
by_column.sum()

            blue       red
Joe    -0.490646  0.234916
Steve   1.241657  1.238602
Wes     1.352760 -0.558839
Jim     1.175459 -0.014589
Travis -1.161254  1.912691

In [75]:
s = pd.Series(mapping)

In [76]:
s

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [81]:
# we can group even using series as mappers
people.groupby(by=s,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [84]:
#we can group by a function in pandas
#here we are grouping by length
people.groupby(len).sum()

          a         b         c         d         e
3  0.431201  1.330546 -0.617691  2.655265 -2.100259
5  0.471576  0.428780  0.199030  1.042627  0.338245
6  0.394687  1.485726 -0.236599 -0.924655  0.032278

In [87]:
people.groupby([len,['one','one','one','two','two']]).sum()

              a         b         c         d         e
3 one  0.019017  1.057309 -1.242449  2.104563 -1.400248
  two  0.412184  0.273238  0.624758  0.550701 -0.700011
5 one  0.471576  0.428780  0.199030  1.042627  0.338245
6 two  0.394687  1.485726 -0.236599 -0.924655  0.032278

In [97]:
#we can use multiindex in or the levels in a group by operation
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
     [1, 3, 5, 1, 3]], names=['cty', 'tenor'])

In [98]:
 hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [108]:
hier_df.groupby(level=0, axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [110]:
#data aggregation
df

  key1 key2     data1     data2
0    a  one -0.661651  2.442757
1    a  two -0.026491 -0.339985
2    b  one  1.020548 -2.039771
3    b  two  2.354768  2.193726
4    a  one  0.816261  0.565412

In [111]:
g = df.groupby('key1')

In [115]:
g['data1'].quantile(.9)

key1
a    0.647711
b    2.221346
Name: data1, dtype: float64

In [118]:
#using self define functions are allowed in pandas dataframes as long as
#we use functions that accept a list of elements as a parameter
def range_data(arr):
    return arr.max() - arr.min()

In [119]:
g.agg(range_data)

         data1     data2
key1
a     1.477913  2.782743
b     1.334220  4.233497

In [122]:
import scipy

In [131]:
def mode(arr):
    v = scipy.stats.mode(arr)[0]
    return v

In [132]:
g.agg(mode)

     key2     data1     data2
key1
a     one -0.661651 -0.339985
b     one  1.020548 -2.039771

In [135]:
group.describe()

          data1     data2
count  1.000000  1.000000
mean   0.327264  0.581667
std         NaN       NaN
min    0.327264  0.581667
25%    0.327264  0.581667
50%    0.327264  0.581667
75%    0.327264  0.581667
max    0.327264  0.581667